app/views/locker/view.html.erb

SELECT "lockers".* FROM "lockers" WHERE "lockers"."size" = ?  [["size", "2"]]
---
    <tbody>
      <% Locker.where(size: params[:id]).each do |lock| %>