app/controllers/locker_controller.rb

INSERT INTO "lockers" ("number", "size", "student", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["number", "24"], ["size", "2"], ["student", "Hunter Hewitt"], ["created_at", "2019-06-26 04:02:50.491420"], ["updated_at", "2019-06-26 04:02:50.491420"]]
---
  def create
    @locker = Locker.new(locker_params)
    if(@locker.save)